In [ ]:
#| hide
%load_ext autoreload
%autoreload 2

# utilsforecast

> Forecasting utilities

## Install

```sh
pip install utilsforecast
```

## How to use

### Generate synthetic data

In [ ]:
from utilsforecast.data import generate_series

In [ ]:
series = generate_series(3, with_trend=True, static_as_categorical=False)
series

     unique_id         ds           y
0            0 2000-01-01    0.422133
1            0 2000-01-02    1.501407
2            0 2000-01-03    2.568495
3            0 2000-01-04    3.529085
4            0 2000-01-05    4.481929
..         ...        ...         ...
481          2 2000-06-11  163.914625
482          2 2000-06-12  166.018479
483          2 2000-06-13  160.839176
484          2 2000-06-14  162.679603
485          2 2000-06-15  165.089288

[486 rows x 3 columns]

### Plotting

In [ ]:
from utilsforecast.plotting import plot_series

In [ ]:
fig = plot_series(series, plot_random=False, max_insample_length=50, engine='matplotlib')
fig.savefig('imgs/index.png', bbox_inches='tight')

![](imgs/index.png)

### Preprocessing

In [ ]:
from utilsforecast.preprocessing import fill_gaps

In [ ]:
serie = series[series['unique_id'].eq(0)].tail(10)
# drop some points
with_gaps = serie.sample(frac=0.5, random_state=0).sort_values('ds')
with_gaps

     unique_id         ds          y
213          0 2000-08-01  18.543147
214          0 2000-08-02  19.941764
216          0 2000-08-04  21.968733
220          0 2000-08-08  19.091509
221          0 2000-08-09  20.220739

In [ ]:
fill_gaps(with_gaps, freq='D')

   unique_id         ds          y
0          0 2000-08-01  18.543147
1          0 2000-08-02  19.941764
2          0 2000-08-03        NaN
3          0 2000-08-04  21.968733
4          0 2000-08-05        NaN
5          0 2000-08-06        NaN
6          0 2000-08-07        NaN
7          0 2000-08-08  19.091509
8          0 2000-08-09  20.220739